7767517
334 354
Input            data             0 1 data 0=112 1=112 2=3
Convolution      conv_1_conv2d    1 1 data conv_1_conv2d 0=64 1=3 2=1 3=2 4=1 5=0 6=1728
BatchNorm        conv_1_batchnorm 1 1 conv_1_conv2d conv_1_batchnorm 0=64
Scale            conv_1_batchnorm_scale 1 1 conv_1_batchnorm conv_1_batchnorm_conv_1_batchnorm_scale 0=64 1=1
PReLU            conv_1_relu      1 1 conv_1_batchnorm_conv_1_batchnorm_scale conv_1_relu 0=64
ConvolutionDepthWise conv_2_dw_conv2d 1 1 conv_1_relu conv_2_dw_conv2d 0=64 1=3 2=1 3=1 4=1 5=0 6=576 7=64
BatchNorm        conv_2_dw_batchnorm 1 1 conv_2_dw_conv2d conv_2_dw_batchnorm 0=64
Scale            conv_2_dw_batchnorm_scale 1 1 conv_2_dw_batchnorm conv_2_dw_batchnorm_conv_2_dw_batchnorm_scale 0=64 1=1
PReLU            conv_2_dw_relu   1 1 conv_2_dw_batchnorm_conv_2_dw_batchnorm_scale conv_2_dw_relu 0=64
Convolution      dconv_23_conv_sep_conv2d 1 1 conv_2_dw_relu dconv_23_conv_sep_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=8192
BatchNorm        dconv_23_conv_sep_batchnorm 1 1 dconv_23_conv_sep_conv2d dconv_23_conv_sep_batchnorm 0=128
Scale            dconv_23_conv_sep_batchnorm_scale 1 1 dconv_23_conv_sep_batchnorm dconv_23_conv_sep_batchnorm_dconv_23_conv_sep_batchnorm_scale 0=128 1=1
PReLU            dconv_23_conv_sep_relu 1 1 dconv_23_conv_sep_batchnorm_dconv_23_conv_sep_batchnorm_scale dconv_23_conv_sep_relu 0=128
ConvolutionDepthWise dconv_23_conv_dw_conv2d 1 1 dconv_23_conv_sep_relu dconv_23_conv_dw_conv2d 0=128 1=3 2=1 3=2 4=1 5=0 6=1152 7=128
BatchNorm        dconv_23_conv_dw_batchnorm 1 1 dconv_23_conv_dw_conv2d dconv_23_conv_dw_batchnorm 0=128
Scale            dconv_23_conv_dw_batchnorm_scale 1 1 dconv_23_conv_dw_batchnorm dconv_23_conv_dw_batchnorm_dconv_23_conv_dw_batchnorm_scale 0=128 1=1
PReLU            dconv_23_conv_dw_relu 1 1 dconv_23_conv_dw_batchnorm_dconv_23_conv_dw_batchnorm_scale dconv_23_conv_dw_relu 0=128
Convolution      dconv_23_conv_proj_conv2d 1 1 dconv_23_conv_dw_relu dconv_23_conv_proj_conv2d 0=64 1=1 2=1 3=1 4=0 5=0 6=8192
BatchNorm        dconv_23_conv_proj_batchnorm 1 1 dconv_23_conv_proj_conv2d dconv_23_conv_proj_batchnorm 0=64
Scale            dconv_23_conv_proj_batchnorm_scale 1 1 dconv_23_conv_proj_batchnorm dconv_23_conv_proj_batchnorm_dconv_23_conv_proj_batchnorm_scale 0=64 1=1
Split            splitncnn_0      1 2 dconv_23_conv_proj_batchnorm_dconv_23_conv_proj_batchnorm_scale dconv_23_conv_proj_batchnorm_dconv_23_conv_proj_batchnorm_scale_splitncnn_0 dconv_23_conv_proj_batchnorm_dconv_23_conv_proj_batchnorm_scale_splitncnn_1
Convolution      res_3_block0_conv_sep_conv2d 1 1 dconv_23_conv_proj_batchnorm_dconv_23_conv_proj_batchnorm_scale_splitncnn_1 res_3_block0_conv_sep_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=8192
BatchNorm        res_3_block0_conv_sep_batchnorm 1 1 res_3_block0_conv_sep_conv2d res_3_block0_conv_sep_batchnorm 0=128
Scale            res_3_block0_conv_sep_batchnorm_scale 1 1 res_3_block0_conv_sep_batchnorm res_3_block0_conv_sep_batchnorm_res_3_block0_conv_sep_batchnorm_scale 0=128 1=1
PReLU            res_3_block0_conv_sep_relu 1 1 res_3_block0_conv_sep_batchnorm_res_3_block0_conv_sep_batchnorm_scale res_3_block0_conv_sep_relu 0=128
ConvolutionDepthWise res_3_block0_conv_dw_conv2d 1 1 res_3_block0_conv_sep_relu res_3_block0_conv_dw_conv2d 0=128 1=3 2=1 3=1 4=1 5=0 6=1152 7=128
BatchNorm        res_3_block0_conv_dw_batchnorm 1 1 res_3_block0_conv_dw_conv2d res_3_block0_conv_dw_batchnorm 0=128
Scale            res_3_block0_conv_dw_batchnorm_scale 1 1 res_3_block0_conv_dw_batchnorm res_3_block0_conv_dw_batchnorm_res_3_block0_conv_dw_batchnorm_scale 0=128 1=1
PReLU            res_3_block0_conv_dw_relu 1 1 res_3_block0_conv_dw_batchnorm_res_3_block0_conv_dw_batchnorm_scale res_3_block0_conv_dw_relu 0=128
Convolution      res_3_block0_conv_proj_conv2d 1 1 res_3_block0_conv_dw_relu res_3_block0_conv_proj_conv2d 0=64 1=1 2=1 3=1 4=0 5=0 6=8192
BatchNorm        res_3_block0_conv_proj_batchnorm 1 1 res_3_block0_conv_proj_conv2d res_3_block0_conv_proj_batchnorm 0=64
Scale            res_3_block0_conv_proj_batchnorm_scale 1 1 res_3_block0_conv_proj_batchnorm res_3_block0_conv_proj_batchnorm_res_3_block0_conv_proj_batchnorm_scale 0=64 1=1
Eltwise          _plus0           2 1 res_3_block0_conv_proj_batchnorm_res_3_block0_conv_proj_batchnorm_scale dconv_23_conv_proj_batchnorm_dconv_23_conv_proj_batchnorm_scale_splitncnn_0 _plus0 0=1 -23301=0
Split            splitncnn_1      1 2 _plus0 _plus0_splitncnn_0 _plus0_splitncnn_1
Convolution      res_3_block1_conv_sep_conv2d 1 1 _plus0_splitncnn_1 res_3_block1_conv_sep_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=8192
BatchNorm        res_3_block1_conv_sep_batchnorm 1 1 res_3_block1_conv_sep_conv2d res_3_block1_conv_sep_batchnorm 0=128
Scale            res_3_block1_conv_sep_batchnorm_scale 1 1 res_3_block1_conv_sep_batchnorm res_3_block1_conv_sep_batchnorm_res_3_block1_conv_sep_batchnorm_scale 0=128 1=1
PReLU            res_3_block1_conv_sep_relu 1 1 res_3_block1_conv_sep_batchnorm_res_3_block1_conv_sep_batchnorm_scale res_3_block1_conv_sep_relu 0=128
ConvolutionDepthWise res_3_block1_conv_dw_conv2d 1 1 res_3_block1_conv_sep_relu res_3_block1_conv_dw_conv2d 0=128 1=3 2=1 3=1 4=1 5=0 6=1152 7=128
BatchNorm        res_3_block1_conv_dw_batchnorm 1 1 res_3_block1_conv_dw_conv2d res_3_block1_conv_dw_batchnorm 0=128
Scale            res_3_block1_conv_dw_batchnorm_scale 1 1 res_3_block1_conv_dw_batchnorm res_3_block1_conv_dw_batchnorm_res_3_block1_conv_dw_batchnorm_scale 0=128 1=1
PReLU            res_3_block1_conv_dw_relu 1 1 res_3_block1_conv_dw_batchnorm_res_3_block1_conv_dw_batchnorm_scale res_3_block1_conv_dw_relu 0=128
Convolution      res_3_block1_conv_proj_conv2d 1 1 res_3_block1_conv_dw_relu res_3_block1_conv_proj_conv2d 0=64 1=1 2=1 3=1 4=0 5=0 6=8192
BatchNorm        res_3_block1_conv_proj_batchnorm 1 1 res_3_block1_conv_proj_conv2d res_3_block1_conv_proj_batchnorm 0=64
Scale            res_3_block1_conv_proj_batchnorm_scale 1 1 res_3_block1_conv_proj_batchnorm res_3_block1_conv_proj_batchnorm_res_3_block1_conv_proj_batchnorm_scale 0=64 1=1
Eltwise          _plus1           2 1 res_3_block1_conv_proj_batchnorm_res_3_block1_conv_proj_batchnorm_scale _plus0_splitncnn_0 _plus1 0=1 -23301=0
Split            splitncnn_2      1 2 _plus1 _plus1_splitncnn_0 _plus1_splitncnn_1
Convolution      res_3_block2_conv_sep_conv2d 1 1 _plus1_splitncnn_1 res_3_block2_conv_sep_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=8192
BatchNorm        res_3_block2_conv_sep_batchnorm 1 1 res_3_block2_conv_sep_conv2d res_3_block2_conv_sep_batchnorm 0=128
Scale            res_3_block2_conv_sep_batchnorm_scale 1 1 res_3_block2_conv_sep_batchnorm res_3_block2_conv_sep_batchnorm_res_3_block2_conv_sep_batchnorm_scale 0=128 1=1
PReLU            res_3_block2_conv_sep_relu 1 1 res_3_block2_conv_sep_batchnorm_res_3_block2_conv_sep_batchnorm_scale res_3_block2_conv_sep_relu 0=128
ConvolutionDepthWise res_3_block2_conv_dw_conv2d 1 1 res_3_block2_conv_sep_relu res_3_block2_conv_dw_conv2d 0=128 1=3 2=1 3=1 4=1 5=0 6=1152 7=128
BatchNorm        res_3_block2_conv_dw_batchnorm 1 1 res_3_block2_conv_dw_conv2d res_3_block2_conv_dw_batchnorm 0=128
Scale            res_3_block2_conv_dw_batchnorm_scale 1 1 res_3_block2_conv_dw_batchnorm res_3_block2_conv_dw_batchnorm_res_3_block2_conv_dw_batchnorm_scale 0=128 1=1
PReLU            res_3_block2_conv_dw_relu 1 1 res_3_block2_conv_dw_batchnorm_res_3_block2_conv_dw_batchnorm_scale res_3_block2_conv_dw_relu 0=128
Convolution      res_3_block2_conv_proj_conv2d 1 1 res_3_block2_conv_dw_relu res_3_block2_conv_proj_conv2d 0=64 1=1 2=1 3=1 4=0 5=0 6=8192
BatchNorm        res_3_block2_conv_proj_batchnorm 1 1 res_3_block2_conv_proj_conv2d res_3_block2_conv_proj_batchnorm 0=64
Scale            res_3_block2_conv_proj_batchnorm_scale 1 1 res_3_block2_conv_proj_batchnorm res_3_block2_conv_proj_batchnorm_res_3_block2_conv_proj_batchnorm_scale 0=64 1=1
Eltwise          _plus2           2 1 res_3_block2_conv_proj_batchnorm_res_3_block2_conv_proj_batchnorm_scale _plus1_splitncnn_0 _plus2 0=1 -23301=0
Split            splitncnn_3      1 2 _plus2 _plus2_splitncnn_0 _plus2_splitncnn_1
Convolution      res_3_block3_conv_sep_conv2d 1 1 _plus2_splitncnn_1 res_3_block3_conv_sep_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=8192
BatchNorm        res_3_block3_conv_sep_batchnorm 1 1 res_3_block3_conv_sep_conv2d res_3_block3_conv_sep_batchnorm 0=128
Scale            res_3_block3_conv_sep_batchnorm_scale 1 1 res_3_block3_conv_sep_batchnorm res_3_block3_conv_sep_batchnorm_res_3_block3_conv_sep_batchnorm_scale 0=128 1=1
PReLU            res_3_block3_conv_sep_relu 1 1 res_3_block3_conv_sep_batchnorm_res_3_block3_conv_sep_batchnorm_scale res_3_block3_conv_sep_relu 0=128
ConvolutionDepthWise res_3_block3_conv_dw_conv2d 1 1 res_3_block3_conv_sep_relu res_3_block3_conv_dw_conv2d 0=128 1=3 2=1 3=1 4=1 5=0 6=1152 7=128
BatchNorm        res_3_block3_conv_dw_batchnorm 1 1 res_3_block3_conv_dw_conv2d res_3_block3_conv_dw_batchnorm 0=128
Scale            res_3_block3_conv_dw_batchnorm_scale 1 1 res_3_block3_conv_dw_batchnorm res_3_block3_conv_dw_batchnorm_res_3_block3_conv_dw_batchnorm_scale 0=128 1=1
PReLU            res_3_block3_conv_dw_relu 1 1 res_3_block3_conv_dw_batchnorm_res_3_block3_conv_dw_batchnorm_scale res_3_block3_conv_dw_relu 0=128
Convolution      res_3_block3_conv_proj_conv2d 1 1 res_3_block3_conv_dw_relu res_3_block3_conv_proj_conv2d 0=64 1=1 2=1 3=1 4=0 5=0 6=8192
BatchNorm        res_3_block3_conv_proj_batchnorm 1 1 res_3_block3_conv_proj_conv2d res_3_block3_conv_proj_batchnorm 0=64
Scale            res_3_block3_conv_proj_batchnorm_scale 1 1 res_3_block3_conv_proj_batchnorm res_3_block3_conv_proj_batchnorm_res_3_block3_conv_proj_batchnorm_scale 0=64 1=1
Eltwise          _plus3           2 1 res_3_block3_conv_proj_batchnorm_res_3_block3_conv_proj_batchnorm_scale _plus2_splitncnn_0 _plus3 0=1 -23301=0
Convolution      dconv_34_conv_sep_conv2d 1 1 _plus3 dconv_34_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=16384
BatchNorm        dconv_34_conv_sep_batchnorm 1 1 dconv_34_conv_sep_conv2d dconv_34_conv_sep_batchnorm 0=256
Scale            dconv_34_conv_sep_batchnorm_scale 1 1 dconv_34_conv_sep_batchnorm dconv_34_conv_sep_batchnorm_dconv_34_conv_sep_batchnorm_scale 0=256 1=1
PReLU            dconv_34_conv_sep_relu 1 1 dconv_34_conv_sep_batchnorm_dconv_34_conv_sep_batchnorm_scale dconv_34_conv_sep_relu 0=256
ConvolutionDepthWise dconv_34_conv_dw_conv2d 1 1 dconv_34_conv_sep_relu dconv_34_conv_dw_conv2d 0=256 1=3 2=1 3=2 4=1 5=0 6=2304 7=256
BatchNorm        dconv_34_conv_dw_batchnorm 1 1 dconv_34_conv_dw_conv2d dconv_34_conv_dw_batchnorm 0=256
Scale            dconv_34_conv_dw_batchnorm_scale 1 1 dconv_34_conv_dw_batchnorm dconv_34_conv_dw_batchnorm_dconv_34_conv_dw_batchnorm_scale 0=256 1=1
PReLU            dconv_34_conv_dw_relu 1 1 dconv_34_conv_dw_batchnorm_dconv_34_conv_dw_batchnorm_scale dconv_34_conv_dw_relu 0=256
Convolution      dconv_34_conv_proj_conv2d 1 1 dconv_34_conv_dw_relu dconv_34_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        dconv_34_conv_proj_batchnorm 1 1 dconv_34_conv_proj_conv2d dconv_34_conv_proj_batchnorm 0=128
Scale            dconv_34_conv_proj_batchnorm_scale 1 1 dconv_34_conv_proj_batchnorm dconv_34_conv_proj_batchnorm_dconv_34_conv_proj_batchnorm_scale 0=128 1=1
Split            splitncnn_4      1 2 dconv_34_conv_proj_batchnorm_dconv_34_conv_proj_batchnorm_scale dconv_34_conv_proj_batchnorm_dconv_34_conv_proj_batchnorm_scale_splitncnn_0 dconv_34_conv_proj_batchnorm_dconv_34_conv_proj_batchnorm_scale_splitncnn_1
Convolution      res_4_block0_conv_sep_conv2d 1 1 dconv_34_conv_proj_batchnorm_dconv_34_conv_proj_batchnorm_scale_splitncnn_1 res_4_block0_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_block0_conv_sep_batchnorm 1 1 res_4_block0_conv_sep_conv2d res_4_block0_conv_sep_batchnorm 0=256
Scale            res_4_block0_conv_sep_batchnorm_scale 1 1 res_4_block0_conv_sep_batchnorm res_4_block0_conv_sep_batchnorm_res_4_block0_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_4_block0_conv_sep_relu 1 1 res_4_block0_conv_sep_batchnorm_res_4_block0_conv_sep_batchnorm_scale res_4_block0_conv_sep_relu 0=256
ConvolutionDepthWise res_4_block0_conv_dw_conv2d 1 1 res_4_block0_conv_sep_relu res_4_block0_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_4_block0_conv_dw_batchnorm 1 1 res_4_block0_conv_dw_conv2d res_4_block0_conv_dw_batchnorm 0=256
Scale            res_4_block0_conv_dw_batchnorm_scale 1 1 res_4_block0_conv_dw_batchnorm res_4_block0_conv_dw_batchnorm_res_4_block0_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_4_block0_conv_dw_relu 1 1 res_4_block0_conv_dw_batchnorm_res_4_block0_conv_dw_batchnorm_scale res_4_block0_conv_dw_relu 0=256
Convolution      res_4_block0_conv_proj_conv2d 1 1 res_4_block0_conv_dw_relu res_4_block0_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_block0_conv_proj_batchnorm 1 1 res_4_block0_conv_proj_conv2d res_4_block0_conv_proj_batchnorm 0=128
Scale            res_4_block0_conv_proj_batchnorm_scale 1 1 res_4_block0_conv_proj_batchnorm res_4_block0_conv_proj_batchnorm_res_4_block0_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus4           2 1 res_4_block0_conv_proj_batchnorm_res_4_block0_conv_proj_batchnorm_scale dconv_34_conv_proj_batchnorm_dconv_34_conv_proj_batchnorm_scale_splitncnn_0 _plus4 0=1 -23301=0
Split            splitncnn_5      1 2 _plus4 _plus4_splitncnn_0 _plus4_splitncnn_1
Convolution      res_4_block1_conv_sep_conv2d 1 1 _plus4_splitncnn_1 res_4_block1_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_block1_conv_sep_batchnorm 1 1 res_4_block1_conv_sep_conv2d res_4_block1_conv_sep_batchnorm 0=256
Scale            res_4_block1_conv_sep_batchnorm_scale 1 1 res_4_block1_conv_sep_batchnorm res_4_block1_conv_sep_batchnorm_res_4_block1_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_4_block1_conv_sep_relu 1 1 res_4_block1_conv_sep_batchnorm_res_4_block1_conv_sep_batchnorm_scale res_4_block1_conv_sep_relu 0=256
ConvolutionDepthWise res_4_block1_conv_dw_conv2d 1 1 res_4_block1_conv_sep_relu res_4_block1_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_4_block1_conv_dw_batchnorm 1 1 res_4_block1_conv_dw_conv2d res_4_block1_conv_dw_batchnorm 0=256
Scale            res_4_block1_conv_dw_batchnorm_scale 1 1 res_4_block1_conv_dw_batchnorm res_4_block1_conv_dw_batchnorm_res_4_block1_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_4_block1_conv_dw_relu 1 1 res_4_block1_conv_dw_batchnorm_res_4_block1_conv_dw_batchnorm_scale res_4_block1_conv_dw_relu 0=256
Convolution      res_4_block1_conv_proj_conv2d 1 1 res_4_block1_conv_dw_relu res_4_block1_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_block1_conv_proj_batchnorm 1 1 res_4_block1_conv_proj_conv2d res_4_block1_conv_proj_batchnorm 0=128
Scale            res_4_block1_conv_proj_batchnorm_scale 1 1 res_4_block1_conv_proj_batchnorm res_4_block1_conv_proj_batchnorm_res_4_block1_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus5           2 1 res_4_block1_conv_proj_batchnorm_res_4_block1_conv_proj_batchnorm_scale _plus4_splitncnn_0 _plus5 0=1 -23301=0
Split            splitncnn_6      1 2 _plus5 _plus5_splitncnn_0 _plus5_splitncnn_1
Convolution      res_4_block2_conv_sep_conv2d 1 1 _plus5_splitncnn_1 res_4_block2_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_block2_conv_sep_batchnorm 1 1 res_4_block2_conv_sep_conv2d res_4_block2_conv_sep_batchnorm 0=256
Scale            res_4_block2_conv_sep_batchnorm_scale 1 1 res_4_block2_conv_sep_batchnorm res_4_block2_conv_sep_batchnorm_res_4_block2_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_4_block2_conv_sep_relu 1 1 res_4_block2_conv_sep_batchnorm_res_4_block2_conv_sep_batchnorm_scale res_4_block2_conv_sep_relu 0=256
ConvolutionDepthWise res_4_block2_conv_dw_conv2d 1 1 res_4_block2_conv_sep_relu res_4_block2_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_4_block2_conv_dw_batchnorm 1 1 res_4_block2_conv_dw_conv2d res_4_block2_conv_dw_batchnorm 0=256
Scale            res_4_block2_conv_dw_batchnorm_scale 1 1 res_4_block2_conv_dw_batchnorm res_4_block2_conv_dw_batchnorm_res_4_block2_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_4_block2_conv_dw_relu 1 1 res_4_block2_conv_dw_batchnorm_res_4_block2_conv_dw_batchnorm_scale res_4_block2_conv_dw_relu 0=256
Convolution      res_4_block2_conv_proj_conv2d 1 1 res_4_block2_conv_dw_relu res_4_block2_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_block2_conv_proj_batchnorm 1 1 res_4_block2_conv_proj_conv2d res_4_block2_conv_proj_batchnorm 0=128
Scale            res_4_block2_conv_proj_batchnorm_scale 1 1 res_4_block2_conv_proj_batchnorm res_4_block2_conv_proj_batchnorm_res_4_block2_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus6           2 1 res_4_block2_conv_proj_batchnorm_res_4_block2_conv_proj_batchnorm_scale _plus5_splitncnn_0 _plus6 0=1 -23301=0
Split            splitncnn_7      1 2 _plus6 _plus6_splitncnn_0 _plus6_splitncnn_1
Convolution      res_4_block3_conv_sep_conv2d 1 1 _plus6_splitncnn_1 res_4_block3_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_block3_conv_sep_batchnorm 1 1 res_4_block3_conv_sep_conv2d res_4_block3_conv_sep_batchnorm 0=256
Scale            res_4_block3_conv_sep_batchnorm_scale 1 1 res_4_block3_conv_sep_batchnorm res_4_block3_conv_sep_batchnorm_res_4_block3_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_4_block3_conv_sep_relu 1 1 res_4_block3_conv_sep_batchnorm_res_4_block3_conv_sep_batchnorm_scale res_4_block3_conv_sep_relu 0=256
ConvolutionDepthWise res_4_block3_conv_dw_conv2d 1 1 res_4_block3_conv_sep_relu res_4_block3_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_4_block3_conv_dw_batchnorm 1 1 res_4_block3_conv_dw_conv2d res_4_block3_conv_dw_batchnorm 0=256
Scale            res_4_block3_conv_dw_batchnorm_scale 1 1 res_4_block3_conv_dw_batchnorm res_4_block3_conv_dw_batchnorm_res_4_block3_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_4_block3_conv_dw_relu 1 1 res_4_block3_conv_dw_batchnorm_res_4_block3_conv_dw_batchnorm_scale res_4_block3_conv_dw_relu 0=256
Convolution      res_4_block3_conv_proj_conv2d 1 1 res_4_block3_conv_dw_relu res_4_block3_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_block3_conv_proj_batchnorm 1 1 res_4_block3_conv_proj_conv2d res_4_block3_conv_proj_batchnorm 0=128
Scale            res_4_block3_conv_proj_batchnorm_scale 1 1 res_4_block3_conv_proj_batchnorm res_4_block3_conv_proj_batchnorm_res_4_block3_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus7           2 1 res_4_block3_conv_proj_batchnorm_res_4_block3_conv_proj_batchnorm_scale _plus6_splitncnn_0 _plus7 0=1 -23301=0
Split            splitncnn_8      1 2 _plus7 _plus7_splitncnn_0 _plus7_splitncnn_1
Convolution      res_4_block4_conv_sep_conv2d 1 1 _plus7_splitncnn_1 res_4_block4_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_block4_conv_sep_batchnorm 1 1 res_4_block4_conv_sep_conv2d res_4_block4_conv_sep_batchnorm 0=256
Scale            res_4_block4_conv_sep_batchnorm_scale 1 1 res_4_block4_conv_sep_batchnorm res_4_block4_conv_sep_batchnorm_res_4_block4_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_4_block4_conv_sep_relu 1 1 res_4_block4_conv_sep_batchnorm_res_4_block4_conv_sep_batchnorm_scale res_4_block4_conv_sep_relu 0=256
ConvolutionDepthWise res_4_block4_conv_dw_conv2d 1 1 res_4_block4_conv_sep_relu res_4_block4_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_4_block4_conv_dw_batchnorm 1 1 res_4_block4_conv_dw_conv2d res_4_block4_conv_dw_batchnorm 0=256
Scale            res_4_block4_conv_dw_batchnorm_scale 1 1 res_4_block4_conv_dw_batchnorm res_4_block4_conv_dw_batchnorm_res_4_block4_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_4_block4_conv_dw_relu 1 1 res_4_block4_conv_dw_batchnorm_res_4_block4_conv_dw_batchnorm_scale res_4_block4_conv_dw_relu 0=256
Convolution      res_4_block4_conv_proj_conv2d 1 1 res_4_block4_conv_dw_relu res_4_block4_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_block4_conv_proj_batchnorm 1 1 res_4_block4_conv_proj_conv2d res_4_block4_conv_proj_batchnorm 0=128
Scale            res_4_block4_conv_proj_batchnorm_scale 1 1 res_4_block4_conv_proj_batchnorm res_4_block4_conv_proj_batchnorm_res_4_block4_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus8           2 1 res_4_block4_conv_proj_batchnorm_res_4_block4_conv_proj_batchnorm_scale _plus7_splitncnn_0 _plus8 0=1 -23301=0
Split            splitncnn_9      1 2 _plus8 _plus8_splitncnn_0 _plus8_splitncnn_1
Convolution      res_4_block5_conv_sep_conv2d 1 1 _plus8_splitncnn_1 res_4_block5_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_block5_conv_sep_batchnorm 1 1 res_4_block5_conv_sep_conv2d res_4_block5_conv_sep_batchnorm 0=256
Scale            res_4_block5_conv_sep_batchnorm_scale 1 1 res_4_block5_conv_sep_batchnorm res_4_block5_conv_sep_batchnorm_res_4_block5_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_4_block5_conv_sep_relu 1 1 res_4_block5_conv_sep_batchnorm_res_4_block5_conv_sep_batchnorm_scale res_4_block5_conv_sep_relu 0=256
ConvolutionDepthWise res_4_block5_conv_dw_conv2d 1 1 res_4_block5_conv_sep_relu res_4_block5_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_4_block5_conv_dw_batchnorm 1 1 res_4_block5_conv_dw_conv2d res_4_block5_conv_dw_batchnorm 0=256
Scale            res_4_block5_conv_dw_batchnorm_scale 1 1 res_4_block5_conv_dw_batchnorm res_4_block5_conv_dw_batchnorm_res_4_block5_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_4_block5_conv_dw_relu 1 1 res_4_block5_conv_dw_batchnorm_res_4_block5_conv_dw_batchnorm_scale res_4_block5_conv_dw_relu 0=256
Convolution      res_4_block5_conv_proj_conv2d 1 1 res_4_block5_conv_dw_relu res_4_block5_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_block5_conv_proj_batchnorm 1 1 res_4_block5_conv_proj_conv2d res_4_block5_conv_proj_batchnorm 0=128
Scale            res_4_block5_conv_proj_batchnorm_scale 1 1 res_4_block5_conv_proj_batchnorm res_4_block5_conv_proj_batchnorm_res_4_block5_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus9           2 1 res_4_block5_conv_proj_batchnorm_res_4_block5_conv_proj_batchnorm_scale _plus8_splitncnn_0 _plus9 0=1 -23301=0
Convolution      dconv_34_add_conv_sep_conv2d 1 1 _plus9 dconv_34_add_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        dconv_34_add_conv_sep_batchnorm 1 1 dconv_34_add_conv_sep_conv2d dconv_34_add_conv_sep_batchnorm 0=256
Scale            dconv_34_add_conv_sep_batchnorm_scale 1 1 dconv_34_add_conv_sep_batchnorm dconv_34_add_conv_sep_batchnorm_dconv_34_add_conv_sep_batchnorm_scale 0=256 1=1
PReLU            dconv_34_add_conv_sep_relu 1 1 dconv_34_add_conv_sep_batchnorm_dconv_34_add_conv_sep_batchnorm_scale dconv_34_add_conv_sep_relu 0=256
ConvolutionDepthWise dconv_34_add_conv_dw_conv2d 1 1 dconv_34_add_conv_sep_relu dconv_34_add_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        dconv_34_add_conv_dw_batchnorm 1 1 dconv_34_add_conv_dw_conv2d dconv_34_add_conv_dw_batchnorm 0=256
Scale            dconv_34_add_conv_dw_batchnorm_scale 1 1 dconv_34_add_conv_dw_batchnorm dconv_34_add_conv_dw_batchnorm_dconv_34_add_conv_dw_batchnorm_scale 0=256 1=1
PReLU            dconv_34_add_conv_dw_relu 1 1 dconv_34_add_conv_dw_batchnorm_dconv_34_add_conv_dw_batchnorm_scale dconv_34_add_conv_dw_relu 0=256
Convolution      dconv_34_add_conv_proj_conv2d 1 1 dconv_34_add_conv_dw_relu dconv_34_add_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        dconv_34_add_conv_proj_batchnorm 1 1 dconv_34_add_conv_proj_conv2d dconv_34_add_conv_proj_batchnorm 0=128
Scale            dconv_34_add_conv_proj_batchnorm_scale 1 1 dconv_34_add_conv_proj_batchnorm dconv_34_add_conv_proj_batchnorm_dconv_34_add_conv_proj_batchnorm_scale 0=128 1=1
Split            splitncnn_10     1 2 dconv_34_add_conv_proj_batchnorm_dconv_34_add_conv_proj_batchnorm_scale dconv_34_add_conv_proj_batchnorm_dconv_34_add_conv_proj_batchnorm_scale_splitncnn_0 dconv_34_add_conv_proj_batchnorm_dconv_34_add_conv_proj_batchnorm_scale_splitncnn_1
Convolution      res_4_add_block0_conv_sep_conv2d 1 1 dconv_34_add_conv_proj_batchnorm_dconv_34_add_conv_proj_batchnorm_scale_splitncnn_1 res_4_add_block0_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_add_block0_conv_sep_batchnorm 1 1 res_4_add_block0_conv_sep_conv2d res_4_add_block0_conv_sep_batchnorm 0=256
Scale            res_4_add_block0_conv_sep_batchnorm_scale 1 1 res_4_add_block0_conv_sep_batchnorm res_4_add_block0_conv_sep_batchnorm_res_4_add_block0_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_4_add_block0_conv_sep_relu 1 1 res_4_add_block0_conv_sep_batchnorm_res_4_add_block0_conv_sep_batchnorm_scale res_4_add_block0_conv_sep_relu 0=256
ConvolutionDepthWise res_4_add_block0_conv_dw_conv2d 1 1 res_4_add_block0_conv_sep_relu res_4_add_block0_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_4_add_block0_conv_dw_batchnorm 1 1 res_4_add_block0_conv_dw_conv2d res_4_add_block0_conv_dw_batchnorm 0=256
Scale            res_4_add_block0_conv_dw_batchnorm_scale 1 1 res_4_add_block0_conv_dw_batchnorm res_4_add_block0_conv_dw_batchnorm_res_4_add_block0_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_4_add_block0_conv_dw_relu 1 1 res_4_add_block0_conv_dw_batchnorm_res_4_add_block0_conv_dw_batchnorm_scale res_4_add_block0_conv_dw_relu 0=256
Convolution      res_4_add_block0_conv_proj_conv2d 1 1 res_4_add_block0_conv_dw_relu res_4_add_block0_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_add_block0_conv_proj_batchnorm 1 1 res_4_add_block0_conv_proj_conv2d res_4_add_block0_conv_proj_batchnorm 0=128
Scale            res_4_add_block0_conv_proj_batchnorm_scale 1 1 res_4_add_block0_conv_proj_batchnorm res_4_add_block0_conv_proj_batchnorm_res_4_add_block0_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus10          2 1 res_4_add_block0_conv_proj_batchnorm_res_4_add_block0_conv_proj_batchnorm_scale dconv_34_add_conv_proj_batchnorm_dconv_34_add_conv_proj_batchnorm_scale_splitncnn_0 _plus10 0=1 -23301=0
Split            splitncnn_11     1 2 _plus10 _plus10_splitncnn_0 _plus10_splitncnn_1
Convolution      res_4_add_block1_conv_sep_conv2d 1 1 _plus10_splitncnn_1 res_4_add_block1_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_add_block1_conv_sep_batchnorm 1 1 res_4_add_block1_conv_sep_conv2d res_4_add_block1_conv_sep_batchnorm 0=256
Scale            res_4_add_block1_conv_sep_batchnorm_scale 1 1 res_4_add_block1_conv_sep_batchnorm res_4_add_block1_conv_sep_batchnorm_res_4_add_block1_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_4_add_block1_conv_sep_relu 1 1 res_4_add_block1_conv_sep_batchnorm_res_4_add_block1_conv_sep_batchnorm_scale res_4_add_block1_conv_sep_relu 0=256
ConvolutionDepthWise res_4_add_block1_conv_dw_conv2d 1 1 res_4_add_block1_conv_sep_relu res_4_add_block1_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_4_add_block1_conv_dw_batchnorm 1 1 res_4_add_block1_conv_dw_conv2d res_4_add_block1_conv_dw_batchnorm 0=256
Scale            res_4_add_block1_conv_dw_batchnorm_scale 1 1 res_4_add_block1_conv_dw_batchnorm res_4_add_block1_conv_dw_batchnorm_res_4_add_block1_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_4_add_block1_conv_dw_relu 1 1 res_4_add_block1_conv_dw_batchnorm_res_4_add_block1_conv_dw_batchnorm_scale res_4_add_block1_conv_dw_relu 0=256
Convolution      res_4_add_block1_conv_proj_conv2d 1 1 res_4_add_block1_conv_dw_relu res_4_add_block1_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_add_block1_conv_proj_batchnorm 1 1 res_4_add_block1_conv_proj_conv2d res_4_add_block1_conv_proj_batchnorm 0=128
Scale            res_4_add_block1_conv_proj_batchnorm_scale 1 1 res_4_add_block1_conv_proj_batchnorm res_4_add_block1_conv_proj_batchnorm_res_4_add_block1_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus11          2 1 res_4_add_block1_conv_proj_batchnorm_res_4_add_block1_conv_proj_batchnorm_scale _plus10_splitncnn_0 _plus11 0=1 -23301=0
Split            splitncnn_12     1 2 _plus11 _plus11_splitncnn_0 _plus11_splitncnn_1
Convolution      res_4_add_block2_conv_sep_conv2d 1 1 _plus11_splitncnn_1 res_4_add_block2_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_add_block2_conv_sep_batchnorm 1 1 res_4_add_block2_conv_sep_conv2d res_4_add_block2_conv_sep_batchnorm 0=256
Scale            res_4_add_block2_conv_sep_batchnorm_scale 1 1 res_4_add_block2_conv_sep_batchnorm res_4_add_block2_conv_sep_batchnorm_res_4_add_block2_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_4_add_block2_conv_sep_relu 1 1 res_4_add_block2_conv_sep_batchnorm_res_4_add_block2_conv_sep_batchnorm_scale res_4_add_block2_conv_sep_relu 0=256
ConvolutionDepthWise res_4_add_block2_conv_dw_conv2d 1 1 res_4_add_block2_conv_sep_relu res_4_add_block2_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_4_add_block2_conv_dw_batchnorm 1 1 res_4_add_block2_conv_dw_conv2d res_4_add_block2_conv_dw_batchnorm 0=256
Scale            res_4_add_block2_conv_dw_batchnorm_scale 1 1 res_4_add_block2_conv_dw_batchnorm res_4_add_block2_conv_dw_batchnorm_res_4_add_block2_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_4_add_block2_conv_dw_relu 1 1 res_4_add_block2_conv_dw_batchnorm_res_4_add_block2_conv_dw_batchnorm_scale res_4_add_block2_conv_dw_relu 0=256
Convolution      res_4_add_block2_conv_proj_conv2d 1 1 res_4_add_block2_conv_dw_relu res_4_add_block2_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_add_block2_conv_proj_batchnorm 1 1 res_4_add_block2_conv_proj_conv2d res_4_add_block2_conv_proj_batchnorm 0=128
Scale            res_4_add_block2_conv_proj_batchnorm_scale 1 1 res_4_add_block2_conv_proj_batchnorm res_4_add_block2_conv_proj_batchnorm_res_4_add_block2_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus12          2 1 res_4_add_block2_conv_proj_batchnorm_res_4_add_block2_conv_proj_batchnorm_scale _plus11_splitncnn_0 _plus12 0=1 -23301=0
Split            splitncnn_13     1 2 _plus12 _plus12_splitncnn_0 _plus12_splitncnn_1
Convolution      res_4_add_block3_conv_sep_conv2d 1 1 _plus12_splitncnn_1 res_4_add_block3_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_add_block3_conv_sep_batchnorm 1 1 res_4_add_block3_conv_sep_conv2d res_4_add_block3_conv_sep_batchnorm 0=256
Scale            res_4_add_block3_conv_sep_batchnorm_scale 1 1 res_4_add_block3_conv_sep_batchnorm res_4_add_block3_conv_sep_batchnorm_res_4_add_block3_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_4_add_block3_conv_sep_relu 1 1 res_4_add_block3_conv_sep_batchnorm_res_4_add_block3_conv_sep_batchnorm_scale res_4_add_block3_conv_sep_relu 0=256
ConvolutionDepthWise res_4_add_block3_conv_dw_conv2d 1 1 res_4_add_block3_conv_sep_relu res_4_add_block3_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_4_add_block3_conv_dw_batchnorm 1 1 res_4_add_block3_conv_dw_conv2d res_4_add_block3_conv_dw_batchnorm 0=256
Scale            res_4_add_block3_conv_dw_batchnorm_scale 1 1 res_4_add_block3_conv_dw_batchnorm res_4_add_block3_conv_dw_batchnorm_res_4_add_block3_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_4_add_block3_conv_dw_relu 1 1 res_4_add_block3_conv_dw_batchnorm_res_4_add_block3_conv_dw_batchnorm_scale res_4_add_block3_conv_dw_relu 0=256
Convolution      res_4_add_block3_conv_proj_conv2d 1 1 res_4_add_block3_conv_dw_relu res_4_add_block3_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_4_add_block3_conv_proj_batchnorm 1 1 res_4_add_block3_conv_proj_conv2d res_4_add_block3_conv_proj_batchnorm 0=128
Scale            res_4_add_block3_conv_proj_batchnorm_scale 1 1 res_4_add_block3_conv_proj_batchnorm res_4_add_block3_conv_proj_batchnorm_res_4_add_block3_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus13          2 1 res_4_add_block3_conv_proj_batchnorm_res_4_add_block3_conv_proj_batchnorm_scale _plus12_splitncnn_0 _plus13 0=1 -23301=0
Convolution      dconv_45_conv_sep_conv2d 1 1 _plus13 dconv_45_conv_sep_conv2d 0=512 1=1 2=1 3=1 4=0 5=0 6=65536
BatchNorm        dconv_45_conv_sep_batchnorm 1 1 dconv_45_conv_sep_conv2d dconv_45_conv_sep_batchnorm 0=512
Scale            dconv_45_conv_sep_batchnorm_scale 1 1 dconv_45_conv_sep_batchnorm dconv_45_conv_sep_batchnorm_dconv_45_conv_sep_batchnorm_scale 0=512 1=1
PReLU            dconv_45_conv_sep_relu 1 1 dconv_45_conv_sep_batchnorm_dconv_45_conv_sep_batchnorm_scale dconv_45_conv_sep_relu 0=512
ConvolutionDepthWise dconv_45_conv_dw_conv2d 1 1 dconv_45_conv_sep_relu dconv_45_conv_dw_conv2d 0=512 1=3 2=1 3=2 4=1 5=0 6=4608 7=512
BatchNorm        dconv_45_conv_dw_batchnorm 1 1 dconv_45_conv_dw_conv2d dconv_45_conv_dw_batchnorm 0=512
Scale            dconv_45_conv_dw_batchnorm_scale 1 1 dconv_45_conv_dw_batchnorm dconv_45_conv_dw_batchnorm_dconv_45_conv_dw_batchnorm_scale 0=512 1=1
PReLU            dconv_45_conv_dw_relu 1 1 dconv_45_conv_dw_batchnorm_dconv_45_conv_dw_batchnorm_scale dconv_45_conv_dw_relu 0=512
Convolution      dconv_45_conv_proj_conv2d 1 1 dconv_45_conv_dw_relu dconv_45_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=65536
BatchNorm        dconv_45_conv_proj_batchnorm 1 1 dconv_45_conv_proj_conv2d dconv_45_conv_proj_batchnorm 0=128
Scale            dconv_45_conv_proj_batchnorm_scale 1 1 dconv_45_conv_proj_batchnorm dconv_45_conv_proj_batchnorm_dconv_45_conv_proj_batchnorm_scale 0=128 1=1
Split            splitncnn_14     1 2 dconv_45_conv_proj_batchnorm_dconv_45_conv_proj_batchnorm_scale dconv_45_conv_proj_batchnorm_dconv_45_conv_proj_batchnorm_scale_splitncnn_0 dconv_45_conv_proj_batchnorm_dconv_45_conv_proj_batchnorm_scale_splitncnn_1
Convolution      res_5_block0_conv_sep_conv2d 1 1 dconv_45_conv_proj_batchnorm_dconv_45_conv_proj_batchnorm_scale_splitncnn_1 res_5_block0_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_5_block0_conv_sep_batchnorm 1 1 res_5_block0_conv_sep_conv2d res_5_block0_conv_sep_batchnorm 0=256
Scale            res_5_block0_conv_sep_batchnorm_scale 1 1 res_5_block0_conv_sep_batchnorm res_5_block0_conv_sep_batchnorm_res_5_block0_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_5_block0_conv_sep_relu 1 1 res_5_block0_conv_sep_batchnorm_res_5_block0_conv_sep_batchnorm_scale res_5_block0_conv_sep_relu 0=256
ConvolutionDepthWise res_5_block0_conv_dw_conv2d 1 1 res_5_block0_conv_sep_relu res_5_block0_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_5_block0_conv_dw_batchnorm 1 1 res_5_block0_conv_dw_conv2d res_5_block0_conv_dw_batchnorm 0=256
Scale            res_5_block0_conv_dw_batchnorm_scale 1 1 res_5_block0_conv_dw_batchnorm res_5_block0_conv_dw_batchnorm_res_5_block0_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_5_block0_conv_dw_relu 1 1 res_5_block0_conv_dw_batchnorm_res_5_block0_conv_dw_batchnorm_scale res_5_block0_conv_dw_relu 0=256
Convolution      res_5_block0_conv_proj_conv2d 1 1 res_5_block0_conv_dw_relu res_5_block0_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_5_block0_conv_proj_batchnorm 1 1 res_5_block0_conv_proj_conv2d res_5_block0_conv_proj_batchnorm 0=128
Scale            res_5_block0_conv_proj_batchnorm_scale 1 1 res_5_block0_conv_proj_batchnorm res_5_block0_conv_proj_batchnorm_res_5_block0_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus14          2 1 res_5_block0_conv_proj_batchnorm_res_5_block0_conv_proj_batchnorm_scale dconv_45_conv_proj_batchnorm_dconv_45_conv_proj_batchnorm_scale_splitncnn_0 _plus14 0=1 -23301=0
Split            splitncnn_15     1 2 _plus14 _plus14_splitncnn_0 _plus14_splitncnn_1
Convolution      res_5_block1_conv_sep_conv2d 1 1 _plus14_splitncnn_1 res_5_block1_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_5_block1_conv_sep_batchnorm 1 1 res_5_block1_conv_sep_conv2d res_5_block1_conv_sep_batchnorm 0=256
Scale            res_5_block1_conv_sep_batchnorm_scale 1 1 res_5_block1_conv_sep_batchnorm res_5_block1_conv_sep_batchnorm_res_5_block1_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_5_block1_conv_sep_relu 1 1 res_5_block1_conv_sep_batchnorm_res_5_block1_conv_sep_batchnorm_scale res_5_block1_conv_sep_relu 0=256
ConvolutionDepthWise res_5_block1_conv_dw_conv2d 1 1 res_5_block1_conv_sep_relu res_5_block1_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_5_block1_conv_dw_batchnorm 1 1 res_5_block1_conv_dw_conv2d res_5_block1_conv_dw_batchnorm 0=256
Scale            res_5_block1_conv_dw_batchnorm_scale 1 1 res_5_block1_conv_dw_batchnorm res_5_block1_conv_dw_batchnorm_res_5_block1_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_5_block1_conv_dw_relu 1 1 res_5_block1_conv_dw_batchnorm_res_5_block1_conv_dw_batchnorm_scale res_5_block1_conv_dw_relu 0=256
Convolution      res_5_block1_conv_proj_conv2d 1 1 res_5_block1_conv_dw_relu res_5_block1_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_5_block1_conv_proj_batchnorm 1 1 res_5_block1_conv_proj_conv2d res_5_block1_conv_proj_batchnorm 0=128
Scale            res_5_block1_conv_proj_batchnorm_scale 1 1 res_5_block1_conv_proj_batchnorm res_5_block1_conv_proj_batchnorm_res_5_block1_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus15          2 1 res_5_block1_conv_proj_batchnorm_res_5_block1_conv_proj_batchnorm_scale _plus14_splitncnn_0 _plus15 0=1 -23301=0
Convolution      dconv_45_add_conv_sep_conv2d 1 1 _plus15 dconv_45_add_conv_sep_conv2d 0=512 1=1 2=1 3=1 4=0 5=0 6=65536
BatchNorm        dconv_45_add_conv_sep_batchnorm 1 1 dconv_45_add_conv_sep_conv2d dconv_45_add_conv_sep_batchnorm 0=512
Scale            dconv_45_add_conv_sep_batchnorm_scale 1 1 dconv_45_add_conv_sep_batchnorm dconv_45_add_conv_sep_batchnorm_dconv_45_add_conv_sep_batchnorm_scale 0=512 1=1
PReLU            dconv_45_add_conv_sep_relu 1 1 dconv_45_add_conv_sep_batchnorm_dconv_45_add_conv_sep_batchnorm_scale dconv_45_add_conv_sep_relu 0=512
ConvolutionDepthWise dconv_45_add_conv_dw_conv2d 1 1 dconv_45_add_conv_sep_relu dconv_45_add_conv_dw_conv2d 0=512 1=3 2=1 3=1 4=1 5=0 6=4608 7=512
BatchNorm        dconv_45_add_conv_dw_batchnorm 1 1 dconv_45_add_conv_dw_conv2d dconv_45_add_conv_dw_batchnorm 0=512
Scale            dconv_45_add_conv_dw_batchnorm_scale 1 1 dconv_45_add_conv_dw_batchnorm dconv_45_add_conv_dw_batchnorm_dconv_45_add_conv_dw_batchnorm_scale 0=512 1=1
PReLU            dconv_45_add_conv_dw_relu 1 1 dconv_45_add_conv_dw_batchnorm_dconv_45_add_conv_dw_batchnorm_scale dconv_45_add_conv_dw_relu 0=512
Convolution      dconv_45_add_conv_proj_conv2d 1 1 dconv_45_add_conv_dw_relu dconv_45_add_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=65536
BatchNorm        dconv_45_add_conv_proj_batchnorm 1 1 dconv_45_add_conv_proj_conv2d dconv_45_add_conv_proj_batchnorm 0=128
Scale            dconv_45_add_conv_proj_batchnorm_scale 1 1 dconv_45_add_conv_proj_batchnorm dconv_45_add_conv_proj_batchnorm_dconv_45_add_conv_proj_batchnorm_scale 0=128 1=1
Split            splitncnn_16     1 2 dconv_45_add_conv_proj_batchnorm_dconv_45_add_conv_proj_batchnorm_scale dconv_45_add_conv_proj_batchnorm_dconv_45_add_conv_proj_batchnorm_scale_splitncnn_0 dconv_45_add_conv_proj_batchnorm_dconv_45_add_conv_proj_batchnorm_scale_splitncnn_1
Convolution      res_5_add_block0_conv_sep_conv2d 1 1 dconv_45_add_conv_proj_batchnorm_dconv_45_add_conv_proj_batchnorm_scale_splitncnn_1 res_5_add_block0_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_5_add_block0_conv_sep_batchnorm 1 1 res_5_add_block0_conv_sep_conv2d res_5_add_block0_conv_sep_batchnorm 0=256
Scale            res_5_add_block0_conv_sep_batchnorm_scale 1 1 res_5_add_block0_conv_sep_batchnorm res_5_add_block0_conv_sep_batchnorm_res_5_add_block0_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_5_add_block0_conv_sep_relu 1 1 res_5_add_block0_conv_sep_batchnorm_res_5_add_block0_conv_sep_batchnorm_scale res_5_add_block0_conv_sep_relu 0=256
ConvolutionDepthWise res_5_add_block0_conv_dw_conv2d 1 1 res_5_add_block0_conv_sep_relu res_5_add_block0_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_5_add_block0_conv_dw_batchnorm 1 1 res_5_add_block0_conv_dw_conv2d res_5_add_block0_conv_dw_batchnorm 0=256
Scale            res_5_add_block0_conv_dw_batchnorm_scale 1 1 res_5_add_block0_conv_dw_batchnorm res_5_add_block0_conv_dw_batchnorm_res_5_add_block0_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_5_add_block0_conv_dw_relu 1 1 res_5_add_block0_conv_dw_batchnorm_res_5_add_block0_conv_dw_batchnorm_scale res_5_add_block0_conv_dw_relu 0=256
Convolution      res_5_add_block0_conv_proj_conv2d 1 1 res_5_add_block0_conv_dw_relu res_5_add_block0_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_5_add_block0_conv_proj_batchnorm 1 1 res_5_add_block0_conv_proj_conv2d res_5_add_block0_conv_proj_batchnorm 0=128
Scale            res_5_add_block0_conv_proj_batchnorm_scale 1 1 res_5_add_block0_conv_proj_batchnorm res_5_add_block0_conv_proj_batchnorm_res_5_add_block0_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus16          2 1 res_5_add_block0_conv_proj_batchnorm_res_5_add_block0_conv_proj_batchnorm_scale dconv_45_add_conv_proj_batchnorm_dconv_45_add_conv_proj_batchnorm_scale_splitncnn_0 _plus16 0=1 -23301=0
Split            splitncnn_17     1 2 _plus16 _plus16_splitncnn_0 _plus16_splitncnn_1
Convolution      res_5_add_block1_conv_sep_conv2d 1 1 _plus16_splitncnn_1 res_5_add_block1_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_5_add_block1_conv_sep_batchnorm 1 1 res_5_add_block1_conv_sep_conv2d res_5_add_block1_conv_sep_batchnorm 0=256
Scale            res_5_add_block1_conv_sep_batchnorm_scale 1 1 res_5_add_block1_conv_sep_batchnorm res_5_add_block1_conv_sep_batchnorm_res_5_add_block1_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_5_add_block1_conv_sep_relu 1 1 res_5_add_block1_conv_sep_batchnorm_res_5_add_block1_conv_sep_batchnorm_scale res_5_add_block1_conv_sep_relu 0=256
ConvolutionDepthWise res_5_add_block1_conv_dw_conv2d 1 1 res_5_add_block1_conv_sep_relu res_5_add_block1_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_5_add_block1_conv_dw_batchnorm 1 1 res_5_add_block1_conv_dw_conv2d res_5_add_block1_conv_dw_batchnorm 0=256
Scale            res_5_add_block1_conv_dw_batchnorm_scale 1 1 res_5_add_block1_conv_dw_batchnorm res_5_add_block1_conv_dw_batchnorm_res_5_add_block1_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_5_add_block1_conv_dw_relu 1 1 res_5_add_block1_conv_dw_batchnorm_res_5_add_block1_conv_dw_batchnorm_scale res_5_add_block1_conv_dw_relu 0=256
Convolution      res_5_add_block1_conv_proj_conv2d 1 1 res_5_add_block1_conv_dw_relu res_5_add_block1_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_5_add_block1_conv_proj_batchnorm 1 1 res_5_add_block1_conv_proj_conv2d res_5_add_block1_conv_proj_batchnorm 0=128
Scale            res_5_add_block1_conv_proj_batchnorm_scale 1 1 res_5_add_block1_conv_proj_batchnorm res_5_add_block1_conv_proj_batchnorm_res_5_add_block1_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus17          2 1 res_5_add_block1_conv_proj_batchnorm_res_5_add_block1_conv_proj_batchnorm_scale _plus16_splitncnn_0 _plus17 0=1 -23301=0
Split            splitncnn_18     1 2 _plus17 _plus17_splitncnn_0 _plus17_splitncnn_1
Convolution      res_5_add_block2_conv_sep_conv2d 1 1 _plus17_splitncnn_1 res_5_add_block2_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_5_add_block2_conv_sep_batchnorm 1 1 res_5_add_block2_conv_sep_conv2d res_5_add_block2_conv_sep_batchnorm 0=256
Scale            res_5_add_block2_conv_sep_batchnorm_scale 1 1 res_5_add_block2_conv_sep_batchnorm res_5_add_block2_conv_sep_batchnorm_res_5_add_block2_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_5_add_block2_conv_sep_relu 1 1 res_5_add_block2_conv_sep_batchnorm_res_5_add_block2_conv_sep_batchnorm_scale res_5_add_block2_conv_sep_relu 0=256
ConvolutionDepthWise res_5_add_block2_conv_dw_conv2d 1 1 res_5_add_block2_conv_sep_relu res_5_add_block2_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_5_add_block2_conv_dw_batchnorm 1 1 res_5_add_block2_conv_dw_conv2d res_5_add_block2_conv_dw_batchnorm 0=256
Scale            res_5_add_block2_conv_dw_batchnorm_scale 1 1 res_5_add_block2_conv_dw_batchnorm res_5_add_block2_conv_dw_batchnorm_res_5_add_block2_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_5_add_block2_conv_dw_relu 1 1 res_5_add_block2_conv_dw_batchnorm_res_5_add_block2_conv_dw_batchnorm_scale res_5_add_block2_conv_dw_relu 0=256
Convolution      res_5_add_block2_conv_proj_conv2d 1 1 res_5_add_block2_conv_dw_relu res_5_add_block2_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_5_add_block2_conv_proj_batchnorm 1 1 res_5_add_block2_conv_proj_conv2d res_5_add_block2_conv_proj_batchnorm 0=128
Scale            res_5_add_block2_conv_proj_batchnorm_scale 1 1 res_5_add_block2_conv_proj_batchnorm res_5_add_block2_conv_proj_batchnorm_res_5_add_block2_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus18          2 1 res_5_add_block2_conv_proj_batchnorm_res_5_add_block2_conv_proj_batchnorm_scale _plus17_splitncnn_0 _plus18 0=1 -23301=0
Split            splitncnn_19     1 2 _plus18 _plus18_splitncnn_0 _plus18_splitncnn_1
Convolution      res_5_add_block3_conv_sep_conv2d 1 1 _plus18_splitncnn_1 res_5_add_block3_conv_sep_conv2d 0=256 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_5_add_block3_conv_sep_batchnorm 1 1 res_5_add_block3_conv_sep_conv2d res_5_add_block3_conv_sep_batchnorm 0=256
Scale            res_5_add_block3_conv_sep_batchnorm_scale 1 1 res_5_add_block3_conv_sep_batchnorm res_5_add_block3_conv_sep_batchnorm_res_5_add_block3_conv_sep_batchnorm_scale 0=256 1=1
PReLU            res_5_add_block3_conv_sep_relu 1 1 res_5_add_block3_conv_sep_batchnorm_res_5_add_block3_conv_sep_batchnorm_scale res_5_add_block3_conv_sep_relu 0=256
ConvolutionDepthWise res_5_add_block3_conv_dw_conv2d 1 1 res_5_add_block3_conv_sep_relu res_5_add_block3_conv_dw_conv2d 0=256 1=3 2=1 3=1 4=1 5=0 6=2304 7=256
BatchNorm        res_5_add_block3_conv_dw_batchnorm 1 1 res_5_add_block3_conv_dw_conv2d res_5_add_block3_conv_dw_batchnorm 0=256
Scale            res_5_add_block3_conv_dw_batchnorm_scale 1 1 res_5_add_block3_conv_dw_batchnorm res_5_add_block3_conv_dw_batchnorm_res_5_add_block3_conv_dw_batchnorm_scale 0=256 1=1
PReLU            res_5_add_block3_conv_dw_relu 1 1 res_5_add_block3_conv_dw_batchnorm_res_5_add_block3_conv_dw_batchnorm_scale res_5_add_block3_conv_dw_relu 0=256
Convolution      res_5_add_block3_conv_proj_conv2d 1 1 res_5_add_block3_conv_dw_relu res_5_add_block3_conv_proj_conv2d 0=128 1=1 2=1 3=1 4=0 5=0 6=32768
BatchNorm        res_5_add_block3_conv_proj_batchnorm 1 1 res_5_add_block3_conv_proj_conv2d res_5_add_block3_conv_proj_batchnorm 0=128
Scale            res_5_add_block3_conv_proj_batchnorm_scale 1 1 res_5_add_block3_conv_proj_batchnorm res_5_add_block3_conv_proj_batchnorm_res_5_add_block3_conv_proj_batchnorm_scale 0=128 1=1
Eltwise          _plus19          2 1 res_5_add_block3_conv_proj_batchnorm_res_5_add_block3_conv_proj_batchnorm_scale _plus18_splitncnn_0 _plus19 0=1 -23301=0
Convolution      conv_6sep_conv2d 1 1 _plus19 conv_6sep_conv2d 0=512 1=1 2=1 3=1 4=0 5=0 6=65536
BatchNorm        conv_6sep_batchnorm 1 1 conv_6sep_conv2d conv_6sep_batchnorm 0=512
Scale            conv_6sep_batchnorm_scale 1 1 conv_6sep_batchnorm conv_6sep_batchnorm_conv_6sep_batchnorm_scale 0=512 1=1
PReLU            conv_6sep_relu   1 1 conv_6sep_batchnorm_conv_6sep_batchnorm_scale conv_6sep_relu 0=512
ConvolutionDepthWise conv_6dw7_7_conv2d 1 1 conv_6sep_relu conv_6dw7_7_conv2d 0=512 1=7 2=1 3=1 4=0 5=0 6=25088 7=512
BatchNorm        conv_6dw7_7_batchnorm 1 1 conv_6dw7_7_conv2d conv_6dw7_7_batchnorm 0=512
Scale            conv_6dw7_7_batchnorm_scale 1 1 conv_6dw7_7_batchnorm conv_6dw7_7_batchnorm_conv_6dw7_7_batchnorm_scale 0=512 1=1
InnerProduct     pre_fc1          1 1 conv_6dw7_7_batchnorm_conv_6dw7_7_batchnorm_scale pre_fc1 0=256 1=1 2=131072
BatchNorm        fc1              1 1 pre_fc1 fc1 0=256
Scale            fc1_scale        1 1 fc1 fc1_fc1_scale 0=256 1=1
